InformationRegisters/КР_ДанныеОтложенногоЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ДанныеОтложенногоЗаполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_СостоянияОбработкиОтложенногоВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХэшИдетрификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КР_СостоянияОбработкиОтложенногоВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КР_СостоянияОбработкиОтложенногоВыполнения</Name>
			<Comment>JIRA№A2105505-991</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КЗаписиВБазуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КритичнаяОшибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КР_ДанныеОтложенногоЗаполнения/Ext/ManagerModule.bsl
// 26.05.2023 Марченко С.Н., КРОК, JIRA№A2105505-991

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(
	ТипДанных, Данные, ХэшИдетрификаторОбъекта, 
	Ссылка = Неопределено, Перезаписывать = Истина
	) Экспорт 

	Если Ссылка = Неопределено Тогда 
		Состояние = Перечисления.КР_СостоянияОбработкиОтложенногоВыполнения.КЗаписиВБазуДанных;  
	Иначе
		Состояние = Перечисления.КР_СостоянияОбработкиОтложенногоВыполнения.КОбработке;  
		GUID = XMLСтрока(Ссылка);
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Если Не Перезаписывать Тогда 
		Запись.ХэшИдетрификаторОбъекта = ХэшИдетрификаторОбъекта; 
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Запись.ХэшИдетрификаторОбъекта = ХэшИдетрификаторОбъекта; 
	Запись.Данные = Данные;                                         
	Запись.ТипДанных = ТипДанных;
	Запись.Состояние = Состояние;  
	Запись.GUID = GUID;

	МассивСообщений = Новый Массив;
	МассивСообщенийСеанса = ПолучитьСообщенияПользователю(Истина);
	Для Каждого СообщениеПользователю Из МассивСообщенийСеанса Цикл   
		Если СтрНачинаетсяС(СообщениеПользователю.Текст, "{") Тогда 
			Продолжить;
		КонецЕсли;	
		МассивСообщений.Добавить(СообщениеПользователю.Текст);
	КонецЦикла;

	Запись.СообщенияПользователю = СтрСоединить(МассивСообщений, Символы.ПС);    
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

Функция УстановитьСостояниеЗаписи(ХэшИдетрификаторОбъекта, Состояние) Экспорт 
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ХэшИдетрификаторОбъекта = ХэшИдетрификаторОбъекта;   
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда 
		Возврат Ложь
	КонецЕсли;	
	
	//// При установке состояния Обработано сразу удаляем запись из РС
	//Если Состояние = Перечисления.КР_СостоянияОбработкиОтложенногоВыполнения.Обработано Тогда 
	//	Запись.Удалить();
	//	Возврат Истина;
	//КонецЕсли;	
	
	МассивСообщений = Новый Массив;

	МассивСообщенийСеанса = ПолучитьСообщенияПользователю(Истина);
	Для Каждого СообщениеПользователю Из МассивСообщенийСеанса Цикл
		Если СтрНачинаетсяС(СообщениеПользователю.Текст, "{") Тогда 
			Продолжить;
		КонецЕсли;	
		МассивСообщений.Добавить(СообщениеПользователю.Текст);
	КонецЦикла;

	Запись.Состояние = Состояние;  
	Запись.СообщенияПользователю = СтрСоединить(МассивСообщений, Символы.ПС);    
	Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции	

Функция УдалитьЗапись(ХэшИдетрификаторОбъекта) Экспорт 
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ХэшИдетрификаторОбъекта = ХэшИдетрификаторОбъекта;   
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда 
		Возврат Ложь
	КонецЕсли;	
	
	Запись.Удалить(); 
	Возврат Истина;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
